$(function() {
  $('.slider').slick({
    arrows: false, //показ стрілок
    dots: true, //показ крапок під слайдами
    adaptiveHeight: false, //адаптація екрану під розміри слайдів
    slidesToShow: 3.6, //к-ть показаних слайдів
    slidesToScroll: 1, //к-ть слайдів для прокрутки
    speed: 500, //час прокрутки в мілісекундах 1с = 1000мс 0.5сек = 500
    easing: 'ease', //вказуємо тип анімації
    autoplay: true, //автоматичне програвання слайдів
    autoplaySpeed: 3000, //період, через який слайди автоматично програються
    pauseOnDotsHover: true, //пауза при наведдені курсора на крапки
    
  });
});

$(function() {
  $('.sliderCircle').slick({
    arrows: true, //показ стрілок
    dots: true, //показ крапок під слайдами
    adaptiveHeight: false, //адаптація екрану під розміри слайдів
    slidesToShow: 1, //к-ть показаних слайдів
    slidesToScroll: 1, //к-ть слайдів для прокрутки
    speed: 500, //час прокрутки в мілісекундах 1с = 1000мс 0.5сек = 500
    easing: 'ease', //вказуємо тип анімації
    autoplay: true, //автоматичне програвання слайдів
    autoplaySpeed: 3400, //період, через який слайди автоматично програються
    pauseOnDotsHover: true, //пауза при наведдені курсора на крапки
    
  });
});

$(function() {
  $('.lastSection').slick({
    arrows: false, //показ стрілок
    dots: true, //показ крапок під слайдами
    adaptiveHeight: false, //адаптація екрану під розміри слайдів
    slidesToShow: 2, //к-ть показаних слайдів
    slidesToScroll: 1, //к-ть слайдів для прокрутки
    speed: 500, //час прокрутки в мілісекундах 1с = 1000мс 0.5сек = 500
    easing: 'linear', //вказуємо тип анімації
    autoplay: true, //автоматичне програвання слайдів
    autoplaySpeed: 3400, //період, через який слайди автоматично програються
    pauseOnDotsHover: true, //пауза при наведдені курсора на крапки
    
  });
});
